; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   desktype bathtubbasintype bedtype shelftype toiletpaperhangertype laundryhampertype garbagecantype drawertype - receptacletype
   winebottletype vasetype toiletpaperrolltype remotecontroltype breadtype watchtype appletype pantype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   desk_1 bathtubbasin_2 bed_3 shelf_4 toiletpaperhanger_5 laundryhamper_6 garbagecan_7 drawer_8 microwave_9 fridge_10 - receptacle
   winebottle_1 vase_2 toiletpaperroll_3 remotecontrol_4 bread_5 watch_6 apple_7 pan_8 - obj
 )
 (:init (receptacletype_0 desk_1 desktype) (receptacletype_0 bathtubbasin_2 bathtubbasintype) (receptacletype_0 bed_3 bedtype) (receptacletype_0 shelf_4 shelftype) (receptacletype_0 toiletpaperhanger_5 toiletpaperhangertype) (receptacletype_0 laundryhamper_6 laundryhampertype) (receptacletype_0 garbagecan_7 garbagecantype) (receptacletype_0 drawer_8 drawertype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 winebottle_1 winebottletype) (objecttype_0 vase_2 vasetype) (objecttype_0 toiletpaperroll_3 toiletpaperrolltype) (objecttype_0 remotecontrol_4 remotecontroltype) (objecttype_0 bread_5 breadtype) (objecttype_0 watch_6 watchtype) (objecttype_0 apple_7 appletype) (objecttype_0 pan_8 pantype) (cancontain desktype winebottletype) (cancontain desktype vasetype) (cancontain desktype toiletpaperrolltype) (cancontain desktype remotecontroltype) (cancontain desktype watchtype) (cancontain shelftype winebottletype) (cancontain shelftype vasetype) (cancontain shelftype toiletpaperrolltype) (cancontain shelftype remotecontroltype) (cancontain shelftype watchtype) (cancontain toiletpaperhangertype toiletpaperrolltype) (cancontain garbagecantype winebottletype) (cancontain garbagecantype toiletpaperrolltype) (cancontain garbagecantype breadtype) (cancontain garbagecantype appletype) (cancontain drawertype toiletpaperrolltype) (cancontain drawertype remotecontroltype) (cancontain drawertype watchtype) (cancontain microwavetype breadtype) (cancontain microwavetype appletype) (cancontain fridgetype winebottletype) (cancontain fridgetype breadtype) (cancontain fridgetype appletype) (cancontain fridgetype pantype) (pickupable winebottle_1) (pickupable vase_2) (pickupable toiletpaperroll_3) (pickupable remotecontrol_4) (pickupable bread_5) (heatable bread_5) (coolable bread_5) (sliceable bread_5) (pickupable watch_6) (pickupable apple_7) (cleanable apple_7) (heatable apple_7) (coolable apple_7) (sliceable apple_7) (pickupable pan_8) (isreceptacleobject pan_8) (cleanable pan_8) (coolable pan_8) (receptacleatlocation desk_1 location7) (receptacleatlocation bathtubbasin_2 location2) (receptacleatlocation bed_3 location4) (receptacleatlocation shelf_4 location5) (receptacleatlocation toiletpaperhanger_5 location2) (receptacleatlocation laundryhamper_6 location7) (receptacleatlocation garbagecan_7 location6) (receptacleatlocation drawer_8 location2) (receptacleatlocation microwave_9 location6) (receptacleatlocation fridge_10 location7) (inreceptacle winebottle_1 shelf_4) (inreceptacle vase_2 desk_1) (inreceptacle toiletpaperroll_3 shelf_4) (inreceptacle remotecontrol_4 drawer_8) (inreceptacle bread_5 microwave_9) (inreceptacle watch_6 desk_1) (inreceptacle apple_7 fridge_10) (inreceptacle pan_8 fridge_10) (objectatlocation winebottle_1 location5) (objectatlocation vase_2 location7) (objectatlocation toiletpaperroll_3 location5) (objectatlocation remotecontrol_4 location2) (objectatlocation bread_5 location6) (objectatlocation watch_6 location7) (objectatlocation apple_7 location7) (objectatlocation pan_8 location7) (atlocation agent1 location2) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (heatable ?o) (objecttype_0 ?o breadtype) (receptacletype_0 ?r garbagecantype) (ishot ?o) (inreceptacle ?o ?r))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location2 location6)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location6)
   goals met: 0 of 1
2. (pickupobject agent1 location6 bread_5 microwave_9)
   deleted: (inreceptacle bread_5 microwave_9) (objectatlocation bread_5 location6)
   added: (holds agent1 bread_5) (holdsany agent1)
   goals met: 0 of 1
3. (heatobject agent1 location6 microwave_9 bread_5)
   added: (ishot bread_5)
   goals met: 0 of 1
4. (putobject agent1 location6 bread_5 garbagecan_7 breadtype garbagecantype)
   deleted: (holds agent1 bread_5) (holdsany agent1)
   added: (inreceptacle bread_5 garbagecan_7) (objectatlocation bread_5 location6)
   goals met: 1 of 1
